In [1]:
import  sqlite3
import pandas as pd

In [2]:
connection = sqlite3.connect('database.sqlite')
cursor = connection.cursor()

In [3]:
cursor.execute(
    """CREATE TABLE PRODUCT (
    id INT PRIMARY KEY,
    name TEXT NOT NULL,
    price INT NOT NULL
) ;"""
)

connection.commit()

In [4]:
cursor.execute(
    """INSERT INTO PRODUCT (id, name, price) VALUES 
    (1, 'iPhone15', 180000000),
    (2, 'Galaxy Z-Fold 5', 300000000)
"""
)

connection.commit()

In [5]:
data = pd.read_sql_query("select * from PRODUCT", connection)
print(data)

   id             name      price
0   1         iPhone15  180000000
1   2  Galaxy Z-Fold 5  300000000

In [6]:
cursor.execute(
    """UPDATE PRODUCT
    SET  PRICE = 50000000
    WHERE name = 'Galaxy Z-Fold 5'
"""
)

connection.commit()

In [7]:
data = pd.read_sql_query("select * from PRODUCT", connection)
print(data)

   id             name      price
0   1         iPhone15  180000000
1   2  Galaxy Z-Fold 5   50000000

In [9]:
cursor.execute(
    """DELETE FROM PRODUCT
    WHERE name = 'iPhone15'
"""
)

connection.commit()

In [10]:
data = pd.read_sql_query("select * from PRODUCT", connection)
print(data)

   id             name     price
0   2  Galaxy Z-Fold 5  50000000